/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   main.cpp                                           :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: makbulut <makbulut@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/11/11 15:48:10 by makbulut          #+#    #+#             */
/*   Updated: 2022/11/12 03:25:58 by makbulut         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <iostream>

int main(void)
{
	std::string a;
	while (a != "EXİT")
	{
		std::cin >> a;
		if (a != "EXİT")
			std::cout << a << std::endl;
	}
	return 0;
}